STMicroelectronics/STM32CubeWB/Projects/P-NUCLEO-WB55.Nucleo/Applications/Zigbee/Zigbee_DoorLock_Server_Coord/STM32_WPAN/App/app_zigbee.c
/**
 ******************************************************************************
 * File Name          : App/app_zigbee.c
 * Description        : Zigbee Application.
 ******************************************************************************
 * @attention
 *
 * <h2><center>&copy; Copyright (c) 2019 STMicroelectronics.
 * All rights reserved.</center></h2>
 *
 * This software component is licensed by ST under Ultimate Liberty license
 * SLA0044, the "License"; You may not use this file except in compliance with
 * the License. You may obtain a copy of the License at:
 *                             www.st.com/SLA0044
 *
 ******************************************************************************
 */

/* Includes ------------------------------------------------------------------*/
#include "app_common.h"
#include "app_entry.h"
#include "dbg_trace.h"
#include "app_zigbee.h"
#include "zigbee_interface.h"
#include "shci.h"
#include "stm_logging.h"
#include "app_conf.h"
#include "stm32wbxx_core_interface_def.h"
#include "zigbee_types.h"
#include "stm32_seq.h"

#include <assert.h>
#include "zcl/zcl.h"
#include "zcl/zcl.time.h"
#include "zcl/zcl.alarm.h"
#include "zcl/zcl.doorlock.h"

/* Private defines -----------------------------------------------------------*/
#define APP_ZIGBEE_STARTUP_FAIL_DELAY               500U
#define SW1_ENDPOINT                                17
#define CHANNEL                                     19
#define HW_TS_SERVER_1S_NB_TICKS                    (1*1000*1000/CFG_TS_TICK_VAL)

/* Alarm specific defines -------------------------------------------------*/
#define ZCL_ALARM_LOG_ENTRY_NB                      4U   

/* DoorLock specific defines -------------------------------------------------*/
#define MAX_PIN_NB_USERS                            5
#define DOORLOCK_PASSAGE_MODE_DURATION              10*HW_TS_SERVER_1S_NB_TICKS
#define DOORLOCK_AUTO_RELOCK_TIME                   5

#define DOORLOCK_DOORSTATE_OPEN                     0x00
#define DOORLOCK_DOORSTATE_CLOSE                    0x01
#define DOORLOCK_DOORSTATE_ERROR_JAMMED             0x02
#define DOORLOCK_DOORSTATE_ERROR_FORCED_OPEN        0x03
#define DOORLOCK_DOORSTATE_ERROR_UNSPECIFIED        0x04
#define DOORLOCK_DOORSTATE_ERROR_UNDEFINED          0xFF

#define DOORLOCK_NORMAL_MODE                        0x00
#define DOORLOCK_VACATION_MODE                      0x01
#define DOORLOCK_PRIVACY_MODE                       0x02
#define DOORLOCK_NO_RF_LOCK_UNLOCK_MODE             0x03
#define DOORLOCK_PASSAGE_MODE                       0x04
#define DOORLOCK_NORMAL_MODE_SUPPORTED              1 << DOORLOCK_NORMAL_MODE
#define DOORLOCK_VACATION_MODE_SUPPORTED            1 << DOORLOCK_VACATION_MODE
#define DOORLOCK_PRIVACY_MODE_SUPPORTED             1 << DOORLOCK_PRIVACY_MODE
#define DOORLOCK_NO_RF_LOCK_UNLOCK_MODE_SUPPORTED   1 << DOORLOCK_NO_RF_LOCK_UNLOCK_MODE
#define DOORLOCK_PASSAGE_MODE_SUPPORTED             1 << DOORLOCK_PASSAGE_MODE

/* Deadbolt Jammed alarm */
#define DOORLOCK_ALARM_DEADBOLT_JAMMED              0x00
/* Lock Reset to Factory Defaults alarm */
#define DOORLOCK_ALARM_RESET                        0x01
/* RF Module Power Cycled alarm */
#define DOORLOCK_ALARM_RF_MODULE                    0x03
/* Tamper Alarm – wrong code entry limit */
#define DOORLOCK_ALARM_WRONG_CODE_LIMIT             0x04
/* Tamper Alarm - front escutcheon removed from main */
#define DOORLOCK_ALARM_FRONT                        0x05
/* Forced Door Open under Door Locked Condition alarm */
#define DOORLOCK_ALARM_FORCED_DOOR                  0x06

struct doorlock_info_t {
  uint8_t current_nb_users;
  struct ZbZclDoorLockSetPinReqT user_tab[MAX_PIN_NB_USERS];
};

/* external definition */
enum ZbStatusCodeT ZbStartupWait(struct ZigBeeT *zb, struct ZbStartupT *config);

/* Private function prototypes -----------------------------------------------*/
static void APP_ZIGBEE_StackLayersInit(void);
static void APP_ZIGBEE_ConfigEndpoints(void);
static void APP_ZIGBEE_SW1_Process(void);
static void APP_ZIGBEE_SW2_Process(void);
static void APP_ZIGBEE_NwkForm(void);
static void APP_ZIGBEE_App_Init(void);

static void APP_ZIGBEE_BINDING_TABLE_insert(uint16_t ntw_addr, uint8_t endpoint, uint16_t cluster_id);

/* Time */
static uint32_t APP_ZIGBEE_Time_Server_GetTime_cb(struct ZbZclClusterT *clusterPtr, void *arg);
static void APP_ZIGBEE_Time_Server_SetTime_cb(struct ZbZclClusterT *clusterPtr, uint32_t time_val, void *arg);

/* Door Lock */
static void APP_ZIGBEE_DoorLock_Server_Init(void);
static void APP_ZIGBEE_DoorLock_Server_PassageMode(void);
static void APP_ZIGBEE_DoorLock_Server_PassageMode_exec(void);
static void APP_ZIGBEE_DoorLock_Server_PassageMode_Ended(void);
static void APP_ZIGBEE_DoorLock_Server_PassageMode_Ended_exec(void);
static void APP_ZIGBEE_DoorLock_Server_AutoRelockTime(void);
static void APP_ZIGBEE_DoorLock_Server_AutoRelockTime_exec(void);
static int8_t APP_ZIGBEE_DoorLock_Server_search_userID(struct doorlock_info_t* info, uint16_t user_id);
static int8_t APP_ZIGBEE_DoorLock_Server_search_PIN(struct doorlock_info_t* info, uint8_t pin[], uint8_t pin_len);
static enum ZclStatusCodeT APP_ZIGBEE_DoorLock_Server_Attr_cb(struct ZbZclClusterT *clusterPtr, struct ZbZclAttrCbInfoT *cb);
static enum ZclStatusCodeT APP_ZIGBEE_DoorLock_Server_AttrNotify_cb(struct ZbZclClusterT *clusterPtr, struct ZbApsAddrT *src, 
                                                                   uint16_t attributeId, const uint8_t *inputData, unsigned int inputMaxLen, 
                                                                   void *attrData, ZclWriteModeT mode, void *app_cb_arg);
static enum ZclStatusCodeT APP_ZIGBEE_DoorLock_Server_Lock_cb(struct ZbZclClusterT *clusterPtr, struct ZbZclDoorLockLockDoorReqT *cmd_req, 
                                                              struct ZbZclAddrInfoT *srcInfo, void *arg);
static enum ZclStatusCodeT APP_ZIGBEE_DoorLock_Server_Unlock_cb(struct ZbZclClusterT *clusterPtr, struct ZbZclDoorLockUnlockDoorReqT *cmd_req, 
                                                                struct ZbZclAddrInfoT *srcInfo, void *arg);
static enum ZclStatusCodeT APP_ZIGBEE_DoorLock_Server_SetPin_cb(struct ZbZclClusterT *clusterPtr, struct ZbZclDoorLockSetPinReqT *cmd_req, 
                                                                struct ZbZclAddrInfoT *srcInfo, void *arg);

static void APP_ZIGBEE_TraceError(const char *pMess, uint32_t ErrCode);
static void APP_ZIGBEE_CheckWirelessFirmwareInfo(void);

static void Wait_Getting_Ack_From_M0(void);
static void Receive_Ack_From_M0(void);
static void Receive_Notification_From_M0(void);

