STMicroelectronics/STM32CubeWB/Projects/P-NUCLEO-WB55.Nucleo/Applications/Zigbee/Zigbee_DoorLock_Server_Coord/STM32_WPAN/App/app_zigbee.c
/* Private variables -----------------------------------------------*/
static TL_CmdPacket_t *p_ZIGBEE_otcmdbuffer;
static TL_EvtPacket_t *p_ZIGBEE_notif_M0_to_M4;
static TL_EvtPacket_t *p_ZIGBEE_request_M0_to_M4;
static __IO uint32_t CptReceiveNotifyFromM0 = 0;
static __IO uint32_t CptReceiveRequestFromM0 = 0;

PLACE_IN_SECTION("MB_MEM1") ALIGN(4) static TL_ZIGBEE_Config_t ZigbeeConfigBuffer;
PLACE_IN_SECTION("MB_MEM2") ALIGN(4) static TL_CmdPacket_t ZigbeeOtCmdBuffer;
PLACE_IN_SECTION("MB_MEM2") ALIGN(4) static uint8_t ZigbeeNotifRspEvtBuffer[sizeof(TL_PacketHeader_t) + TL_EVT_HDR_SIZE + 255U];
PLACE_IN_SECTION("MB_MEM2") ALIGN(4) static uint8_t ZigbeeNotifRequestBuffer[sizeof(TL_PacketHeader_t) + TL_EVT_HDR_SIZE + 255U];

/* Adding required optional attributes */
static const struct ZbZclAttrT optionalAttrList[] = {
    {
        ZCL_DOORLOCK_ATTR_DOORSTATE, ZCL_DATATYPE_UNSIGNED_8BIT,
        ZCL_ATTR_FLAG_CB_NOTIFY, 0, APP_ZIGBEE_DoorLock_Server_Attr_cb, {0, 0}, {0, 0}
    },
};

struct zigbee_app_info {
  bool has_init;
  struct ZigBeeT *zb;
  enum ZbStatusCodeT join_status;
  uint32_t join_delay;

  struct ZbZclClusterT *doorlock_server;
  struct ZbZclClusterT *time_server;
  struct ZbZclClusterT *alarm_server;
};
static struct zigbee_app_info zigbee_app_info;

/* Time server custom callbacks */
struct ZbZclTimeServerCallbacks ZbZclTimeServerCallbacks = {
  .get_time = APP_ZIGBEE_Time_Server_GetTime_cb,
  .set_time = APP_ZIGBEE_Time_Server_SetTime_cb,
};

/* DoorLock server custom callbacks */
static struct ZbZclDoorLockServerCallbacksT DoorLockServerCallbacks = {
  .lock = APP_ZIGBEE_DoorLock_Server_Lock_cb,
  .unlock = APP_ZIGBEE_DoorLock_Server_Unlock_cb,
  .set_pin = APP_ZIGBEE_DoorLock_Server_SetPin_cb,
};

static struct doorlock_info_t doorlock_info;
static uint8_t TS_ID1, TS_ID2; 

/* Functions Definition ------------------------------------------------------*/

/**
 * @brief  Adding entry in binding table
 * @param  ntw_addr: Network address
 * @param  endpoint: Endpoint
 * @param  cluster_id: ZCL cluster ID
 * @retval None
 */
static void APP_ZIGBEE_BINDING_TABLE_insert(uint16_t ntw_addr, uint8_t endpoint, uint16_t cluster_id){
  enum ZbStatusCodeT status;
  ZbApsmeBindT current_bind;
  ZbApsmeBindReqT bindreq;
  ZbApsmeBindConfT bindconf;
  uint32_t bind_index = 0;
  bool insert_new = false;
  
  /* check if this ntw address with this particular endpoint is in the BT */
  
  /* Searching over the BT */
  for(bind_index=0;;bind_index++){
    
    /* Get the next entry in the binding table. */
    status = ZbApsGetIndex(zigbee_app_info.zb, ZB_APS_IB_ID_BINDING_TABLE, &current_bind, sizeof(ZbApsmeBindT), bind_index);
    if (status != ZB_APS_STATUS_SUCCESS) {
         /* End of table, no matching found */
         insert_new = true;
         break;
    }
    
    if(current_bind.srcExtAddr != 0){
      if((current_bind.clusterId == cluster_id) 
         && (current_bind.dst.nwkAddr == ntw_addr)
         && (current_bind.dst.endpoint == endpoint)){
           /* matching found, exit */
           break;
       }
    }
  }
  
  /* if new, insert it */
  if(insert_new){
    /* Binding request */
    memset(&bindreq, 0, sizeof(bindreq));
    memset(&bindconf, 0, sizeof(bindconf));
    bindreq.srcExtAddr = ZbExtendedAddress(zigbee_app_info.zb);
    bindreq.srcEndpt = SW1_ENDPOINT;
    bindreq.clusterId = cluster_id;
    bindreq.dst.mode = ZB_APSDE_ADDRMODE_EXT;
    bindreq.dst.endpoint = endpoint;
    bindreq.dst.extAddr = ZbNwkAddrLookupExt(zigbee_app_info.zb, ntw_addr);
    
    ZbApsmeBindReq(zigbee_app_info.zb,&bindreq,&bindconf);
      
    if(bindconf.status != ZB_WPAN_STATUS_SUCCESS){
        APP_DBG("[DOORLOCK] Local Bind failed on DoorLock Cluster.\n");
    }
    APP_DBG("[DOORLOCK] Binding the client with ext_addr = %#08llx dest enpoint: %d.\n", bindreq.dst.extAddr, bindreq.dst.endpoint);
  }
}

/**
 * @brief  Door Lock server attribute callback
 * @param  clusterPtr: ZCL cluster pointer
 * @param  cb: Callback info
 * @param  cluster_id: ZCL cluster ID
 * @retval ZCL status code
 */
static enum ZclStatusCodeT APP_ZIGBEE_DoorLock_Server_Attr_cb(struct ZbZclClusterT *clusterPtr, struct ZbZclAttrCbInfoT *cb){
  if (cb->type == ZCL_ATTR_CB_TYPE_NOTIFY) {
    return APP_ZIGBEE_DoorLock_Server_AttrNotify_cb(clusterPtr, cb->src, cb->info->attributeId, cb->zcl_data, cb->zcl_len,
                             cb->attr_data, cb->write_mode, cb->app_cb_arg);
  } else {
    return ZCL_STATUS_FAILURE;
  }
}

/**
 * @brief  Door Lock server attribute notify callback
 * @param  clusterPtr: ZCL cluster pointer
 * @param  src: Source of the command, if not locally generated. May be NULL
 * @param  attributeId: ZCL attribute ID
 * @param  inputData: Incoming or outgoing ZCL attribute payload data
 * @param  inputMaxLen: Incoming or outgoing ZCL attribute payload data length
 * @param  attrData: Local attribute storage (if application is letting the cluster maintain the attribute data)
 * @param  mode: ZCL write mode
 * @param  app_cb_arg: Application's defined callback argument
 * @retval ZCL status code
 */
static enum ZclStatusCodeT APP_ZIGBEE_DoorLock_Server_AttrNotify_cb(struct ZbZclClusterT *clusterPtr, struct ZbApsAddrT *src, 
                                                                   uint16_t attributeId, const uint8_t *inputData, unsigned int inputMaxLen, 
                                                                   void *attrData, ZclWriteModeT mode, void *app_cb_arg){
  enum ZclStatusCodeT status;                                                                   
  uint16_t alarmMask;                                                                   
  uint8_t currentDoorState;
  
  if(clusterPtr != zigbee_app_info.doorlock_server){
    return ZCL_STATUS_FAILURE;
  }
  
  switch(attributeId){
    case ZCL_DOORLOCK_ATTR_DOORSTATE:  
      
      /* getting the door state */
      currentDoorState = (uint8_t)ZbZclAttrIntegerRead(zigbee_app_info.doorlock_server, ZCL_DOORLOCK_ATTR_DOORSTATE, NULL, &status);
      if (status != ZCL_STATUS_SUCCESS){
        APP_DBG("Error reading local attribute.");
        return ZCL_STATUS_FAILURE;
      }
      
      APP_DBG("[DOORLOCK] Door state changed to 0x%02x.", currentDoorState);
      
      /* getting the alarm mask */
      alarmMask = (uint16_t)ZbZclAttrIntegerRead(zigbee_app_info.doorlock_server, ZCL_DOORLOCK_ATTR_ALARM_MASK, NULL, &status);
      if (status != ZCL_STATUS_SUCCESS){
        APP_DBG("Error reading local attribute.");
        return ZCL_STATUS_FAILURE;
      }
      
      /* check the door state */
      if((currentDoorState == DOORLOCK_DOORSTATE_ERROR_FORCED_OPEN)
         && (1<<DOORLOCK_ALARM_FORCED_DOOR & alarmMask)){
        APP_DBG("[DOORLOCK] Problematic value detected for the door state.");
        ZbZclClusterSendAlarm(zigbee_app_info.doorlock_server, ZbZclClusterGetEndpoint(zigbee_app_info.doorlock_server), currentDoorState);
        APP_DBG("[ALARM] Alarm sent for DoorLock cluster clients that are registered in the BT.");
      }
      
      /* setting door state to closed */
      status = ZbZclAttrIntegerWrite(zigbee_app_info.doorlock_server, ZCL_DOORLOCK_ATTR_DOORSTATE, DOORLOCK_DOORSTATE_CLOSE);
      if(status != ZCL_STATUS_SUCCESS){
        APP_DBG("Error writting local attribute.");
        assert(0);
      }
      return ZCL_STATUS_SUCCESS;
      
    default:
      return ZCL_STATUS_FAILURE;
  }
}

/**
 * @brief  DoorLock server lock command callback
 * @param  clusterPtr: ZCL cluster pointer
 * @param  cmd_req: ZCL DoorLock cluster Lock Door request
 * @param  srcInfo: Src address informations
 * @param  arg: passed arguments
 * @retval ZCL status code
 */
static enum ZclStatusCodeT APP_ZIGBEE_DoorLock_Server_Lock_cb(struct ZbZclClusterT *clusterPtr, struct ZbZclDoorLockLockDoorReqT *cmd_req, 
                                                              struct ZbZclAddrInfoT *srcInfo, void *arg)
{
  enum ZclStatusCodeT status;
  struct ZbZclDoorLockLockDoorRspT rsp = {.status = DOORLOCK_STATUS_GENERAL_FAILURE};
  struct doorlock_info_t* info = (struct doorlock_info_t*) arg;  
  long long res;
  uint8_t currentMode = 0;
  int8_t user_pos = 0;
  
  /* Get the lock operating mode */
  currentMode = (uint8_t)ZbZclAttrIntegerRead(zigbee_app_info.doorlock_server, ZCL_DOORLOCK_ATTR_MODE, NULL, &status);
  if (status != ZCL_STATUS_SUCCESS){
    APP_DBG("Error reading local attribute.");
    (void) ZbZclDoorLockServerSendLockRsp(clusterPtr, srcInfo, &rsp, NULL, NULL);
    return ZCL_STATUS_SUCCESS_NO_DEFAULT_RESPONSE;
  }
  
  APP_DBG("Lock requested.");
  
  /* Read the lock state */
  res = ZbZclAttrIntegerRead(zigbee_app_info.doorlock_server, ZCL_DOORLOCK_ATTR_LOCKSTATE, NULL, &status);
  if(status != ZCL_STATUS_SUCCESS){
    APP_DBG("Error reqding local attribute: cannot read lock state.\n");
    (void) ZbZclDoorLockServerSendLockRsp(clusterPtr, srcInfo, &rsp, NULL, NULL);
    return ZCL_STATUS_SUCCESS_NO_DEFAULT_RESPONSE;
  }
  
  if(res == DOORLOCK_LOCKSTATE_LOCKED){
    /* Lock already locked */
    APP_DBG("Already locked!\n");
    (void) ZbZclDoorLockServerSendLockRsp(clusterPtr, srcInfo, &rsp, NULL, NULL);
    return ZCL_STATUS_SUCCESS_NO_DEFAULT_RESPONSE;
  }
  
