STMicroelectronics/STM32CubeWB/Projects/P-NUCLEO-WB55.Nucleo/Applications/Zigbee/Zigbee_DoorLock_Server_Coord/STM32_WPAN/App/app_zigbee.c
  /* Passage mode behaviour */
  if(currentMode == DOORLOCK_PASSAGE_MODE){
    APP_DBG("Passage mode is activated.");
    
    /* Lock is unlocked -> locked it  */
    status = ZbZclAttrIntegerWrite(zigbee_app_info.doorlock_server, ZCL_DOORLOCK_ATTR_LOCKSTATE, DOORLOCK_LOCKSTATE_LOCKED);
    if(status != ZCL_STATUS_SUCCESS){
      APP_DBG("Error writting local attribute: cannot set lock state to 'locked'.\n");
      (void) ZbZclDoorLockServerSendLockRsp(clusterPtr, srcInfo, &rsp, NULL, NULL);
      return ZCL_STATUS_SUCCESS_NO_DEFAULT_RESPONSE;
    }
        
    APP_DBG("Door locked!");
    rsp.status = DOORLOCK_STATUS_SUCCESS;
    
    BSP_LED_On(LED_GREEN);
    APP_DBG("LED_GREEN ON\n");
    
    (void) ZbZclDoorLockServerSendLockRsp(clusterPtr, srcInfo, &rsp, NULL, NULL);
    return ZCL_STATUS_SUCCESS_NO_DEFAULT_RESPONSE;
  }
  
  /* Check pin length */
  if(cmd_req->pin_len>DOORLOCK_MAX_PIN
     || cmd_req->pin_len<DOORLOCK_MIN_PIN){ 
    APP_DBG("Error: Wrong pin format.\n");
    (void) ZbZclDoorLockServerSendLockRsp(clusterPtr, srcInfo, &rsp, NULL, NULL);
    return ZCL_STATUS_SUCCESS_NO_DEFAULT_RESPONSE;
  } 
  
  /* Check if the PIN is valid */
  user_pos = APP_ZIGBEE_DoorLock_Server_search_PIN(info, cmd_req->pin, cmd_req->pin_len);
  if(user_pos < 0){
    APP_DBG("Error: Pin doesn't match.\n");
   (void) ZbZclDoorLockServerSendLockRsp(clusterPtr, srcInfo, &rsp, NULL, NULL);
   return ZCL_STATUS_SUCCESS_NO_DEFAULT_RESPONSE;
  }
  APP_DBG("Request from user %d.", info->user_tab[user_pos].user_id);
  
  /* Lock is unlocked -> locked it  */
  status = ZbZclAttrIntegerWrite(zigbee_app_info.doorlock_server, ZCL_DOORLOCK_ATTR_LOCKSTATE, DOORLOCK_LOCKSTATE_LOCKED);
  if(status != ZCL_STATUS_SUCCESS){
    APP_DBG("Error writting local attribute: cannot set lock state to 'unlocked'.\n");
    (void) ZbZclDoorLockServerSendLockRsp(clusterPtr, srcInfo, &rsp, NULL, NULL);
    return ZCL_STATUS_SUCCESS_NO_DEFAULT_RESPONSE;
  }
      
  APP_DBG("Door locked!");
  rsp.status = DOORLOCK_STATUS_SUCCESS;
  
  BSP_LED_On(LED_GREEN);
  APP_DBG("LED_GREEN ON\n");
  
  /* Stop the Auto Relock Time associated timer */
  HW_TS_Stop(TS_ID2);
  
  (void) ZbZclDoorLockServerSendLockRsp(clusterPtr, srcInfo, &rsp, NULL, NULL);
  return ZCL_STATUS_SUCCESS_NO_DEFAULT_RESPONSE;
} /* APP_ZIGBEE_DoorLock_Server_Lock_cb */

/**
 * @brief  DoorLock server lock command callback
 * @param  clusterPtr: ZCL cluster pointer
 * @param  cmd_req: ZCL DoorLock cluster Unlock Door request
 * @param  srcInfo: Src address informations
 * @param  arg: passed arguments
 * @retval ZCL status code
 */
static enum ZclStatusCodeT APP_ZIGBEE_DoorLock_Server_Unlock_cb(struct ZbZclClusterT *clusterPtr, struct ZbZclDoorLockUnlockDoorReqT *cmd_req, 
                                                                struct ZbZclAddrInfoT *srcInfo, void *arg)
{
  enum ZclStatusCodeT status;
  struct ZbZclDoorLockUnlockDoorRspT rsp = {.status = DOORLOCK_STATUS_GENERAL_FAILURE};
  struct doorlock_info_t* info = (struct doorlock_info_t*) arg;  
  long long res;
  uint32_t autoRelockTime = 0;
  uint16_t currentMode = 0;
  int8_t user_pos = 0;
  
  /* Get the lock operating mode */
  currentMode = (uint8_t)ZbZclAttrIntegerRead(zigbee_app_info.doorlock_server, ZCL_DOORLOCK_ATTR_MODE, NULL, &status);
  if (status != ZCL_STATUS_SUCCESS){
    APP_DBG("Error reading local attribute.");
    (void) ZbZclDoorLockServerSendUnlockRsp(clusterPtr, srcInfo, &rsp, NULL, NULL);
    return ZCL_STATUS_SUCCESS_NO_DEFAULT_RESPONSE;
  }
  
  APP_DBG("Unlock requested.");
  
  /* Read the lock state */
  res = ZbZclAttrIntegerRead(zigbee_app_info.doorlock_server, ZCL_DOORLOCK_ATTR_LOCKSTATE, NULL, &status);
  if(status != ZCL_STATUS_SUCCESS){
    APP_DBG("Error reqding local attribute: cannot reqd lock state.\n");
    (void) ZbZclDoorLockServerSendUnlockRsp(clusterPtr, srcInfo, &rsp, NULL, NULL);
    return ZCL_STATUS_SUCCESS_NO_DEFAULT_RESPONSE;
  }
  
  if(res == DOORLOCK_LOCKSTATE_UNLOCKED){
    /* Lock already unlocked */
    APP_DBG("Already unlocked!\n");
    (void) ZbZclDoorLockServerSendUnlockRsp(clusterPtr, srcInfo, &rsp, NULL, NULL);
    return ZCL_STATUS_SUCCESS_NO_DEFAULT_RESPONSE;
  }
  
  /* Passage mode behaviour */
  if(currentMode == DOORLOCK_PASSAGE_MODE){
    APP_DBG("Passage mode is activated.");
    
  /* Lock is locked -> unlocked it  */
  status = ZbZclAttrIntegerWrite(zigbee_app_info.doorlock_server, ZCL_DOORLOCK_ATTR_LOCKSTATE, DOORLOCK_LOCKSTATE_UNLOCKED);
  if(status != ZCL_STATUS_SUCCESS){
    APP_DBG("Error writting local attribute: cannot set lock state to 'unlocked'.\n");
    (void) ZbZclDoorLockServerSendUnlockRsp(clusterPtr, srcInfo, &rsp, NULL, NULL);
    return ZCL_STATUS_SUCCESS_NO_DEFAULT_RESPONSE;
  }
    
    APP_DBG("Door unlocked!");
    rsp.status = DOORLOCK_STATUS_SUCCESS;
    
    BSP_LED_Off(LED_GREEN);
    APP_DBG("LED_GREEN OFF\n");
  
    (void) ZbZclDoorLockServerSendUnlockRsp(clusterPtr, srcInfo, &rsp, NULL, NULL);
    return ZCL_STATUS_SUCCESS_NO_DEFAULT_RESPONSE;
  }
  
  /* Check pin length */
  if(cmd_req->pin_len>DOORLOCK_MAX_PIN
     || cmd_req->pin_len<DOORLOCK_MIN_PIN){ 
    APP_DBG("Error: Wrong pin format.\n");
    (void) ZbZclDoorLockServerSendUnlockRsp(clusterPtr, srcInfo, &rsp, NULL, NULL);
    return ZCL_STATUS_SUCCESS_NO_DEFAULT_RESPONSE;
  } 
      
  /* Check if the PIN is valid */
  user_pos = APP_ZIGBEE_DoorLock_Server_search_PIN(info, cmd_req->pin, cmd_req->pin_len);
  if(user_pos < 0){
    APP_DBG("Error: Pin doesn't match.\n");
   (void) ZbZclDoorLockServerSendUnlockRsp(clusterPtr, srcInfo, &rsp, NULL, NULL);
   return ZCL_STATUS_SUCCESS_NO_DEFAULT_RESPONSE;
  }
  APP_DBG("Request from user %d.", info->user_tab[user_pos].user_id);
  
  /* Lock is locked -> unlocked it  */
  status = ZbZclAttrIntegerWrite(zigbee_app_info.doorlock_server, ZCL_DOORLOCK_ATTR_LOCKSTATE, DOORLOCK_LOCKSTATE_UNLOCKED);
  if(status != ZCL_STATUS_SUCCESS){
    APP_DBG("Error writting local attribute: cannot set lock state to 'unlocked'.\n");
    (void) ZbZclDoorLockServerSendUnlockRsp(clusterPtr, srcInfo, &rsp, NULL, NULL);
    return ZCL_STATUS_SUCCESS_NO_DEFAULT_RESPONSE;
  }
  
  /* Read the auto relock time value */
  autoRelockTime = ZbZclAttrIntegerRead(zigbee_app_info.doorlock_server, ZCL_DOORLOCK_ATTR_AUTO_RELOCK, NULL, &status);
  if(status != ZCL_STATUS_SUCCESS){
    APP_DBG("Error reqding local attribute: cannot reqd lock state.\n");
    (void) ZbZclDoorLockServerSendUnlockRsp(clusterPtr, srcInfo, &rsp, NULL, NULL);
    return ZCL_STATUS_SUCCESS_NO_DEFAULT_RESPONSE;
  }
    
  /* Start Auto Relock timer with auto relock time attribute value */
  HW_TS_Start(TS_ID2, autoRelockTime*HW_TS_SERVER_1S_NB_TICKS); 
    
