STMicroelectronics/STM32CubeWB/Projects/P-NUCLEO-WB55.Nucleo/Applications/Zigbee/Zigbee_DoorLock_Server_Coord/STM32_WPAN/App/app_zigbee.c
  APP_DBG("Door unlocked for %d seconds !", autoRelockTime);
  rsp.status = DOORLOCK_STATUS_SUCCESS;
  
  BSP_LED_Off(LED_GREEN);
  APP_DBG("LED_GREEN OFF\n");
    
  (void) ZbZclDoorLockServerSendUnlockRsp(clusterPtr, srcInfo, &rsp, NULL, NULL);
  return ZCL_STATUS_SUCCESS_NO_DEFAULT_RESPONSE;
} /* APP_ZIGBEE_DoorLock_Server_Unlock_cb */

/**
 * @brief  DoorLock server set pin command callback
 * @param  clusterPtr: ZCL cluster pointer
 * @param  cmd_req: ZCL DoorLock cluster Unlock Door request
 * @param  srcInfo: Src address informations
 * @param  arg: passed arguments
 * @retval ZCL status code
 */
static enum ZclStatusCodeT APP_ZIGBEE_DoorLock_Server_SetPin_cb(struct ZbZclClusterT *clusterPtr, struct ZbZclDoorLockSetPinReqT *cmd_req, 
                                                                struct ZbZclAddrInfoT *srcInfo, void *arg)
{
  struct ZbZclDoorLockSetPinRspT rsp = {.status = DOORLOCK_STATUS_GENERAL_FAILURE};
  struct doorlock_info_t* info = (struct doorlock_info_t*) arg;  
  APP_DBG("Set PIN requested.");
  
  /* Check if we can add a new PIN user */
  if(info->current_nb_users >= MAX_PIN_NB_USERS){
    APP_DBG("Error: PIN users limit reached.\n");
    rsp.status = DOORLOCK_STATUS_MEM_FULL;
    (void) ZbZclDoorLockServerSendSetPinRsp(clusterPtr, srcInfo, &rsp, NULL, NULL);
    return ZCL_STATUS_SUCCESS_NO_DEFAULT_RESPONSE;
  }
  
  /* Check if the user id is unique */
  if(APP_ZIGBEE_DoorLock_Server_search_userID(info, cmd_req->user_id) < 0){
    APP_DBG("Error: User with ID %d already registered.\n", cmd_req->user_id);
  }
  
  /* PIN length check */
  if(cmd_req->pin_len>DOORLOCK_MAX_PIN
     || cmd_req->pin_len<DOORLOCK_MIN_PIN){ 
    APP_DBG("Error: Wrong pin format.\n");
    (void) ZbZclDoorLockServerSendSetPinRsp(clusterPtr, srcInfo, &rsp, NULL, NULL);
    return ZCL_STATUS_SUCCESS_NO_DEFAULT_RESPONSE;
  } 
  
  /* Check the unicity of the PIN */
  if(APP_ZIGBEE_DoorLock_Server_search_PIN(info, cmd_req->pin, cmd_req->pin_len) < 0){
    APP_DBG("Error: User with this PIN already registered.\n");
  }
  
  /* create the user */
  info->user_tab[info->current_nb_users].user_id = cmd_req->user_id;
  info->user_tab[info->current_nb_users].user_status = cmd_req->user_status;
  info->user_tab[info->current_nb_users].user_type = cmd_req->user_type;
  memcpy(info->user_tab[info->current_nb_users].pin, cmd_req->pin, cmd_req->pin_len);
  info->user_tab[info->current_nb_users].pin_len = cmd_req->pin_len;
  info->current_nb_users++;
  APP_DBG("PIN set for user %d!\n", cmd_req->user_id);
  
  /* Add Alarm client in the server binding table if not present for receiving Alarm notifications */
  /* DoorLock and Alarm cluster are mapped in the same endpoint */
  APP_ZIGBEE_BINDING_TABLE_insert(srcInfo->addr.nwkAddr, srcInfo->addr.endpoint, ZCL_CLUSTER_ALARMS);
  
  rsp.status = DOORLOCK_STATUS_SUCCESS;
  (void) ZbZclDoorLockServerSendSetPinRsp(clusterPtr, srcInfo, &rsp, NULL, NULL);
  return ZCL_STATUS_SUCCESS_NO_DEFAULT_RESPONSE;
}

/**
 * @brief  DoorLock server Passage mode task launcher wrapper
 * @param  None
 * @retval None
 */
static void APP_ZIGBEE_DoorLock_Server_PassageMode_exec(void){
  /* Start the task */
  UTIL_SEQ_SetTask(1U << CFG_ZIGBEE_APP_DOORLOCK_PASSAGE_MODE, CFG_SCH_PRIO_1);
}

/**
 * @brief  DoorLock server enable Passage mode
 * @param  None
 * @retval None
 */
static void APP_ZIGBEE_DoorLock_Server_PassageMode(void){
  enum ZclStatusCodeT status = ZCL_STATUS_FAILURE;
  uint16_t supportedModes = 0;
  uint8_t currentMode = 0;
  
  /* Get current operating mode */
  currentMode = (uint8_t)ZbZclAttrIntegerRead(zigbee_app_info.doorlock_server, ZCL_DOORLOCK_ATTR_MODE, NULL, &status);
  if (status != ZCL_STATUS_SUCCESS){
    APP_DBG("Error reading local attribute.");
    return;
  }
  if(currentMode == DOORLOCK_PASSAGE_MODE){
    /* Already in passage mode*/
    return;
  }
  
  /* Get available operating modes */
  supportedModes = (uint16_t)ZbZclAttrIntegerRead(zigbee_app_info.doorlock_server, ZCL_DOORLOCK_ATTR_SUPPORTED_MODES, NULL, &status);
  if (status != ZCL_STATUS_SUCCESS){
    APP_DBG("Error reading local attribute.");
    return;
  }
  
  /* Check if passage mode is available */
  if(!(supportedModes >> DOORLOCK_PASSAGE_MODE)){
    APP_DBG("Error passage mode not available.");
    return;
  }
  
  /* Activate passage mode */
  status = ZbZclAttrIntegerWrite(zigbee_app_info.doorlock_server, ZCL_DOORLOCK_ATTR_MODE, DOORLOCK_PASSAGE_MODE);
  if(status != ZCL_STATUS_SUCCESS){
    APP_DBG("Error writting local attribute: cannot set operating mode.");
  }
  
  /* Start passage mode duration timer */
  HW_TS_Start(TS_ID1, DOORLOCK_PASSAGE_MODE_DURATION); 
  
  APP_DBG("Passage mode activated.");
  BSP_LED_On(LED_RED);
  APP_DBG("LED_RED ON\n");
}

/**
 * @brief  DoorLock server Passage mode end task launcher wrapper
 * @param  None
 * @retval None
 */
static void APP_ZIGBEE_DoorLock_Server_PassageMode_Ended_exec(void){
  /* Start the task */
  UTIL_SEQ_SetTask(1U << CFG_ZIGBEE_APP_DOORLOCK_PASSAGE_MODE_DURATION, CFG_SCH_PRIO_1);
}

/**
 * @brief  DoorLock server stop Passage mode
 * @param  None
 * @retval None
 */
static void APP_ZIGBEE_DoorLock_Server_PassageMode_Ended(void){
  enum ZclStatusCodeT status = ZCL_STATUS_FAILURE;
  
  /* Operating mode set to normal */
  status = ZbZclAttrIntegerWrite(zigbee_app_info.doorlock_server, ZCL_DOORLOCK_ATTR_MODE, DOORLOCK_NORMAL_MODE);
  if(status != ZCL_STATUS_SUCCESS){
    APP_DBG("Error writting local attribute: cannot set operating mode.");
  }
  
  APP_DBG("Passage mode ended.");
  BSP_LED_Off(LED_RED);
  APP_DBG("LED_RED OFF\n");
}

/**
 * @brief  DoorLock server Auto Relock Time reached task launcher wrapper
 * @param  None
 * @retval None
 */
static void APP_ZIGBEE_DoorLock_Server_AutoRelockTime_exec(void){
  /* Start the task */
  UTIL_SEQ_SetTask(1U << CFG_ZIGBEE_APP_DOORLOCK_AUTO_RELOCK_TIME, CFG_SCH_PRIO_1);
}

/**
 * @brief  DoorLock server Auto Relock Time reached
 * @param  None
 * @retval None
 */
static void APP_ZIGBEE_DoorLock_Server_AutoRelockTime(void){
  enum ZclStatusCodeT status = ZCL_STATUS_FAILURE;
  
  APP_DBG("Auto Relock Time reached.");
  
