STMicroelectronics/STM32CubeWB/Projects/P-NUCLEO-WB55.Nucleo/Applications/Zigbee/Zigbee_DoorLock_Server_Coord/STM32_WPAN/App/app_zigbee.c
  /* Lock the door */
  status = ZbZclAttrIntegerWrite(zigbee_app_info.doorlock_server, ZCL_DOORLOCK_ATTR_LOCKSTATE, DOORLOCK_LOCKSTATE_LOCKED);
  if(status != ZCL_STATUS_SUCCESS){
    APP_DBG("Error writting local attribute: cannot set lock state to 'unlocked'.\n");
    return;
  }
  
  APP_DBG("Door Locked.");
  BSP_LED_On(LED_GREEN);
  APP_DBG("LED_GREEN ON\n");
}

/**
 * @brief  DoorLock server search user by ID
 * @param  info: Door Lock server info
 * @param  user_id: ZCL Door Lock user ID
 * @retval User index in the table if found (-1 otherwise)
 */
static int8_t APP_ZIGBEE_DoorLock_Server_search_userID(struct doorlock_info_t* info, uint16_t user_id){
  int8_t pos = -1, cpt = 0;
  
  if(info->current_nb_users == 0){
    /* no user registered */
    return 0;
  }
  
  while(cpt <= info->current_nb_users){
    if(info->user_tab[cpt].user_id == user_id){
      /* user id found */
      pos = cpt;
      break;
    }
    cpt++;
  }
  
  return pos;
}

/**
 * @brief  DoorLock server search user by PIN
 * @param  info: Door Lock server info
 * @param  pin: PIN code to search
 * @param  pin_len: PIN code length
 * @retval User index in the table if found (-1 otherwise)
 */
static int8_t APP_ZIGBEE_DoorLock_Server_search_PIN(struct doorlock_info_t* info, uint8_t pin[], uint8_t pin_len){
  int8_t pos = -1, cpt = 0;
  
  if(info->current_nb_users == 0){
    /* no user registered */
    return 0;
  }
  
  while(cpt <= info->current_nb_users){
    if(info->user_tab[cpt].pin_len == pin_len 
       && memcmp(info->user_tab[cpt].pin, pin, pin_len) == 0){
      /* pin found */
      pos = cpt;
      break;
    }
    cpt++;
  }
  
  return pos;
}

/**
 * @brief  Time server GetTime callback
 * @param  clusterPtr: ZCL Cluster pointer
 * @param  arg: Passed argument
 * @retval None
 */
static uint32_t APP_ZIGBEE_Time_Server_GetTime_cb(struct ZbZclClusterT *clusterPtr, void *arg){
  uint32_t time = HAL_GetTick()*HW_TS_SERVER_1S_NB_TICKS;
  return time;
}

/**
 * @brief  Time server SetTime callback
 * @param  clusterPtr: ZCL Cluster pointer
 * @param  time_val: time value to set
 * @param  arg: Passed argument
 * @retval None
 */
static void APP_ZIGBEE_Time_Server_SetTime_cb(struct ZbZclClusterT *clusterPtr, uint32_t time_val, void *arg){
  
  /* Unused function */
  
  UNUSED(clusterPtr);
  UNUSED(time_val);
  UNUSED(arg);
}

/**
 * @brief  Zigbee application initialization
 * @param  None
 * @retval None
 */
static void APP_ZIGBEE_App_Init(void){
  /* Task associated with push button SW1 and SW2 */
  UTIL_SEQ_RegTask(1U << CFG_TASK_BUTTON_SW1, UTIL_SEQ_RFU, APP_ZIGBEE_SW1_Process);
  UTIL_SEQ_RegTask(1U << CFG_TASK_BUTTON_SW2, UTIL_SEQ_RFU, APP_ZIGBEE_SW2_Process);
  
  /* Timers associated with Door Lock passage operating mode */
  HW_TS_Create(1U << CFG_TIM_ZIGBEE_APP_DOORLOCK_PASSAGE_MODE_DURATION, &TS_ID1, hw_ts_SingleShot, APP_ZIGBEE_DoorLock_Server_PassageMode_Ended_exec);
  HW_TS_Create(1U << CFG_TIM_ZIGBEE_APP_DOORLOCK_AUTO_RELOCK_TIME, &TS_ID2, hw_ts_SingleShot, APP_ZIGBEE_DoorLock_Server_AutoRelockTime_exec);
  
  /* Task associated with Door Lock passage mode */
  UTIL_SEQ_RegTask(1U << CFG_ZIGBEE_APP_DOORLOCK_PASSAGE_MODE, UTIL_SEQ_RFU, APP_ZIGBEE_DoorLock_Server_PassageMode);
  UTIL_SEQ_RegTask(1U << CFG_ZIGBEE_APP_DOORLOCK_PASSAGE_MODE_DURATION, UTIL_SEQ_RFU, APP_ZIGBEE_DoorLock_Server_PassageMode_Ended);
  UTIL_SEQ_RegTask(1U << CFG_ZIGBEE_APP_DOORLOCK_AUTO_RELOCK_TIME, UTIL_SEQ_RFU, APP_ZIGBEE_DoorLock_Server_AutoRelockTime);
  
  /* Initialize Zigbee Meter Identification Server parameters */
  APP_ZIGBEE_DoorLock_Server_Init();
}

/**
 * @brief  DoorLock server initialization
 * @param  None
 * @retval None
 */
static void APP_ZIGBEE_DoorLock_Server_Init(void){
  enum ZclStatusCodeT status;

  /* Init the PIN user struct */
  memset(&doorlock_info, 0, sizeof(doorlock_info));
  
  /* At startup, the lock is locked */
  status = ZbZclAttrIntegerWrite(zigbee_app_info.doorlock_server, ZCL_DOORLOCK_ATTR_LOCKSTATE, DOORLOCK_LOCKSTATE_LOCKED);
  if(status != ZCL_STATUS_SUCCESS){
    APP_DBG("Error writting local attribute: cannot set lock state to 'locked'.");
    assert(0);
  }
  
  /* Door state is closed */
  status = ZbZclAttrIntegerWrite(zigbee_app_info.doorlock_server, ZCL_DOORLOCK_ATTR_DOORSTATE, DOORLOCK_DOORSTATE_CLOSE);
  if(status != ZCL_STATUS_SUCCESS){
    APP_DBG("Error writting local attribute.");
    assert(0);
  }
  
  /* Setting up supported mode bitmap */
  status = ZbZclAttrIntegerWrite(zigbee_app_info.doorlock_server, ZCL_DOORLOCK_ATTR_SUPPORTED_MODES, 
                                 (uint16_t)DOORLOCK_NORMAL_MODE_SUPPORTED|DOORLOCK_PASSAGE_MODE_SUPPORTED);
  if(status != ZCL_STATUS_SUCCESS){
    APP_DBG("Error writting local attribute: cannot set supported mode.");
    assert(0);
  }
  
  /* Setting up operating mode attribute */
  status = ZbZclAttrIntegerWrite(zigbee_app_info.doorlock_server, ZCL_DOORLOCK_ATTR_MODE, DOORLOCK_NORMAL_MODE);
  if(status != ZCL_STATUS_SUCCESS){
    APP_DBG("Error writting local attribute: cannot set operating mode.");
    assert(0);
  }
  
  /* Setting up auto relock time attribute */
  status = ZbZclAttrIntegerWrite(zigbee_app_info.doorlock_server, ZCL_DOORLOCK_ATTR_AUTO_RELOCK, DOORLOCK_AUTO_RELOCK_TIME);
  if(status != ZCL_STATUS_SUCCESS){
    APP_DBG("Error writting local attribute: cannot set operating mode.");
    assert(0);
  }
  
  /* Setting up alarm bitmap */
  status = ZbZclAttrIntegerWrite(zigbee_app_info.doorlock_server, ZCL_DOORLOCK_ATTR_ALARM_MASK, 1<<DOORLOCK_ALARM_FORCED_DOOR);
  if(status != ZCL_STATUS_SUCCESS){
    APP_DBG("Error writting local attribute: cannot set operating mode.");
    assert(0);
  }
 
  BSP_LED_On(LED_GREEN);
  APP_DBG("LED_GREEN ON");
  APP_DBG("Lock state initialized to 'locked'");
  APP_DBG("DoorLock server init done !\n");
} /* APP_ZIGBEE_DoorLock_Server_Init */

/**
 * @brief  Zigbee application initialization
 * @param  None
 * @retval None
 */
void APP_ZIGBEE_Init(void)
{
  SHCI_CmdStatus_t ZigbeeInitStatus;

